<?php
echo "Данные успешно записаны в таблицу 'order'.";
$arr = ["Круассан классический (75гр)", "Круассан с абрикосом (140гр)", "Круассан с ветчиной и сыром (130гр)", "Круассан с вишней (140гр)", "Круассан с миндалем (160гр)","Круассан с шоколадом (120гр)","Слойка с грушей (140гр)","Слойка с яблоком (140гр)","Улитка с изюмом (160гр)","Французский язык (150гр)",
"С сыром", "С картошкой и сыром", "С зеленью и сыром", "С капустой", "С мясом", 
"С ягодами сдобный","С мясом сдобный","С капустой сдобный","С картофелем и грибами сдобный","Творожно-ягодный сдобный","С жульеном слоеный","С мясом слоеный","С рыбой слоеный","Творожно-ягодный песочный","Лимонник песочный","Штрудель с вишней слоеный","Штрудель с яблоком слоеный", 
"Классическая","Пепперони","Цезарь","Делюкс","Густосо","Маргарита","Сицилия","Четыре сыра","Средиземноморье","Кольцоне закрытая","Вердура овощная","Перфетто","Перченто", 
"Сырники","Лазанья овощная","Лазанья мясная",  "Ачма"];

include 'config.php';

$stmt = $connection->prepare("INSERT INTO `products` (`name_dish`) VALUES (:name)");

// Итерация по массиву данных и выполнение запроса для каждого элемента
foreach ($arr as $name) {
    $stmt->bindParam(':name', $name);
    $stmt->execute();
}

echo "Данные успешно записаны в таблицу 'products'.";
?>
