
var NamesDATA = ["Батон", "Багет французский", "Ржаной круглый", "Хлеб Бородинский", "Хлеб Злаковый", "Хлеб Кукурузный", "Хлеб Деревенский", "Багет с сыром", "Хлеб Атлетик", "Хлеб Провансаль",//хлеб
                "Пирожок с мясом (50гр)", "Пирожок с капустой (50гр)", "Пирожок с картофелем (50гр)", "Пирожок с яйцом и зеленью (50гр)", "Пирожок с картофелем и грибами (50гр)",//Пирожки
                "Булочка с маком (120гр)", "Булочка с корицей (120гр)", "Булочка с яблоком (120гр)", "Булочка с вишней (120гр)", "Булочка с абрикосом (120гр)", "Булочка с клубникой (120гр)",//булочки
                    "Булочка со смородиной (120гр)", "Булочка с ежевикой (120гр)", "Чайная булочка с творогом (160гр)", "Булочка с  ветчиной и сыром (120гр)", "Булочка с банановым кремом (150гр)",//булочки
                    "Булочка с шоколадным кремом (150гр)", "Булочка со сливочно-ванильным кремом (150гр)",//булочки
                "Кутаб с зеленью и сыром (120гр)", "Кутаб с зеленью (120гр)", "Кутаб с мясом (120гр)", "Кутаб с сыром (120гр))",//кутабы
                "Ватрушка (120гр)", "Венгерка (160гр)", "Плюшка (100гр)", "Сочник (150гр)", "Курник (160гр)", "Рыбник (160гр)", "Сосиска в тесте (110гр)", "Хачапури слоёное (85гр)",//выпечка
                    "Хачапури с копченым сыром (160гр)", "Хачапури по-мегрельски (250гр)", "Беляш (180гр)", "Кулебяка (160гр)", "Рогалик с сыром (160гр)", "Самса с говядиной (120гр)",//выпечка
                    "Самса с курицей (120гр)", "Косичка с творогом и изюмом (160гр)", "Косичка с маком (160гр)", "Гнездышко с жульеном (120гр)", "Гнездышко с ветчиной, сыром и ананасом (120гр)",//выпечка
                    "Гнездышко со шпинатом и яйцом (120гр)", "Кесадилья (230гр)", "Чебурек с сыром (120гр)", "Чебурек с мясом (120гр)", "Расстегай (160гр)", "Шаурма (250гр)", "Пицца мини (250гр)",//выпечка
                    "Лепешка с сыром и чесноком (100гр)", "Косичка с курагой и орехом (250гр)",//выпечка
                    "Слойка (плацинда) с творогом и зеленью (130гр)", "Слойка (плацинда) с капустой (130гр)", "Слойка (плацинда) с яблоком (130гр)", "Слойка (плацинда) с картофелем (130гр)",//слоеные изделия(плацинды)
                    "Берлинское (120гр)", "Бриошь с грецким орехом (140гр)", "Бриошь с клубникой (160гр)", "Кольцо с корицей (125гр)", "Кольцо слоеное с творогом (130гр)", "Круассан классический (75гр)", "Круассан с абрикосом (140гр)", "Круассан с ветчиной и сыром (130гр)", "Круассан с вишней (140гр)", "Круассан с миндалем (160гр)","Круассан с шоколадом (120гр)","Слойка с грушей (140гр)","Слойка с яблоком (140гр)","Улитка с изюмом (160гр)","Французский язык (150гр)",//слоеные изделия
                    "С сыром", "С картошкой и сыром", "С зеленью и сыром", "С капустой", "С мясом", //осетинские пироги
                    "С ягодами сдобный","С мясом сдобный","С капустой сдобный","С картофелем и грибами сдобный","Творожно-ягодный сдобный","С жульеном слоеный","С мясом слоеный","С рыбой слоеный","Творожно-ягодный песочный","Лимонник песочный","Штрудель с вишней слоеный","Штрудель с яблоком слоеный", //сдобные и слоеные пироги
                    "Классическая","Пепперони","Цезарь","Делюкс","Густосо","Маргарита","Сицилия","Четыре сыра","Средиземноморье","Кольцоне закрытая","Вердура овощная","Перфетто","Перченто", //пицца
                    "Сырники","Лазанья овощная","Лазанья мясная",  "Ачма", ];//кулинария
var PricesDATA = [ "75", "110", "30", "160", "90", "40", "120", "55", "130", "20", "145", "85", "105", "65", "115", "50", 
"135", "80", "70", "95", "150", "100", "60", "125", "135", "115", "55", "75", "130", "160", "145", "90", "105", "20", "40", 
"150", "70", "120", "85", "100", "65", "50", "80", "95", "110", "30", "160", "75", "115", "135", "125", "130", "60", "90", "145", 
"105", "55", "20", "70", "40", "120", "85", "130", "100", "75", "95", "50", "80", "150", "55", "115", "90", "105", "20", "40", "120",
 "70", "135", "85", "65", "75", "30", "160", "100", "145", "110", "130", "90", "105", "75", "115", "50", "55", "80", "20", "40", "150", 
 "95", "70", "120", "85", "130", "100", "65", "30", "160", "145", "90", "105", "55", "75", "115", "135", "50", "80", "20", "40", "150", "70", 
 "120", "85", "130", "100", "95", "65", "30", "160", "75", "105", "55", "115", "90", "130", "135", "20", "40", "80", "150"];
var bucket;
AllSum('allsum1');

//Добавление продукта
function addProduct(numb) {
    
        let n = localStorage.getItem(numb);
        if (n !== null) {
            localStorage.setItem(numb,parseInt(n)+1);
        }
        else if (n == null) {
        localStorage.setItem(numb, 1);
        }
        AllSum('allsum1');
        showCart('modal_content_table');
    
}


//Удаление продукта
function delProduct(numb) {
    let n = localStorage.getItem(numb);
    if (n == null) {
        console.log('Такого товара в карзине нет');
    } else if (n !== null) {
        localStorage.setItem(numb,parseInt(n)-1);
        n = localStorage.getItem(numb);
        if (n == 0) {
            if (confirm('Убрать товар из корзины?')) {
                localStorage.removeItem(numb);
            } else {
                localStorage.setItem(numb,1);
            }
        }
        AllSum('allsum1');
        showCart('modal_content_table');
    }
}

//Вывод выбраных товаров
function showCart(id) {
    let cartInfo = '';
    if (localStorage.length !== 0) document.getElementById('delBuscket').innerHTML = '<button onclick="clearBasket()">Очистить корзину</button>';
    for (let i = 0; i < localStorage.length; i++) {
        let key = localStorage.key(i);
        cartInfo += `<tr>
                        <td>`+ NamesDATA[key] +`</td>
                        <td>`+ (PricesDATA[key] * localStorage.getItem(key)) +` &#8381;</td>
                        <td>`+ localStorage.getItem(key) +`</td>
                        <td>
                            <button value="1" onclick="addProduct(${key})" class="bucket_button">+</button>
                            <button value="1" onclick="delProduct(${key})" class="bucket_button">-</button>
                        </td>
                    </tr>`;
    }
    document.getElementById(id).innerHTML = cartInfo;
    
    allPrice('total-price');
}

//Очистка корзины
function clearBasket() {
    if (localStorage.length == 0) {
    alert('Корзина уже пустая');
    } else if (confirm('Вы уверены, что хотите очистить корзину?')) {
    let lengthStorage = localStorage.length;
    for (let i = 0; i < lengthStorage; i++) {
    let n = localStorage.key(0);
    localStorage.removeItem(n);
    }
    alert('Корзина очищена');
    }
    showCart('modal_content_table');
    AllSum('allsum1');
    }



//Расчет итоговой стоимости
function allPrice(id) {
    let Price = 0;
    for (let i = 0; i < localStorage.length; i++) {
        let key = localStorage.key(i);
        Price += parseFloat(PricesDATA[key]) * parseInt(localStorage.getItem(key));
    }
    document.getElementById(id).value = Price;
}

//Расчет количества товаров в корзине
function AllSum(id) {
    var allsum = 0;
    for (let i = 0; i < localStorage.length; i++) {
        let key = localStorage.key(i);
        allsum += parseInt(localStorage.getItem(key));
    }
    document.getElementById(id).innerHTML = allsum;
}


function OpenModalBtn(btn) {
    showCart('modal_content_table');
    var modal = document.getElementById('modal');
    var openModalBtn = document.getElementById(btn);
    var closeModalBtn = document.getElementsByClassName('close')[0];
    var cartItems = document.getElementById('cartItems');

    // Открыть модальное окно при клике на кнопку "Открыть корзину"
    openModalBtn.addEventListener('click', function() {
    modal.style.display = 'block';
    });

    // Закрыть модальное окно при клике на кнопку "Закрыть" или за пределами модального окна
    closeModalBtn.addEventListener('click', function() {
    modal.style.display = 'none';
    });

    window.addEventListener('click', function(event) {
    if (event.target == modal) {
        modal.style.display = 'none';
    }
    });
    
}




  